In [39]:
import pandas as pd

### DataFrame A:

In [40]:
data = {
    'id': [1, 2, 3, 4, 5],
    'id_cliente': [101, 102, 103, 104, 105],
    'data_contratacao': ['2023-01-15', '2023-02-20', '2023-03-10', '2023-04-05', '2023-05-12'],
    'id_contrato': [201, 202, 203, 204, 205],
    'valor_contrato': [1000.00, 1500.50, 800.25, 1200.75, 2000.50]
}

In [41]:
df_a = pd.DataFrame(data)
df_a.head()

   id  id_cliente data_contratacao  id_contrato  valor_contrato
0   1         101       2023-01-15          201         1000.00
1   2         102       2023-02-20          202         1500.50
2   3         103       2023-03-10          203          800.25
3   4         104       2023-04-05          204         1200.75
4   5         105       2023-05-12          205         2000.50

### DataFrame B:

In [42]:
data = {
    'id': [1, 2, 3, 4, 5],
    'id_cliente': [101, 102, 103, 104, 105],
    'data_cancelamento': ['2023-05-15', '2023-06-20', '2023-07-10', '2023-08-05', '2023-09-12'],
    'id_contrato': [201, 202, 203, 204, 205],
    'valor_contrato': [1000.00, 1500.50, 800.25, 1200.75, 2000.50]
}

In [43]:
df_b = pd.DataFrame(data)
df_b.head()

   id  id_cliente data_cancelamento  id_contrato  valor_contrato
0   1         101        2023-05-15          201         1000.00
1   2         102        2023-06-20          202         1500.50
2   3         103        2023-07-10          203          800.25
3   4         104        2023-08-05          204         1200.75
4   5         105        2023-09-12          205         2000.50

a) Escreva um código em Python que te permita encontrar uma lista de id_clientes dentro do dataframe A.

In [44]:
lista_clientes_1 = df_a['id_cliente'].unique()
display(lista_clientes_1)

array([101, 102, 103, 104, 105])

b) Existe uma forma mais eficiente de se resolver o item a)? Justifique sua resposta.

In [45]:
lista_clientes_2 = set(df_a['id_cliente'])
display(lista_clientes_2)

{101, 102, 103, 104, 105}

Set é um tipo de dado do python, uma coleção desordenada onde não pode haver números repetidos, então basicamente ao transformar uma lista de 'id_cliente' e um set ele elimina automaticamente as duplicatas, isso é mais eficiente em termos de memória, aqui está a definição de set segundo a documentação do **python**: 

5.4. Conjuntos

Python também inclui um tipo de dados para conjuntos, chamado set. Um conjunto é uma coleção desordenada de elementos, sem elementos repetidos. Usos comuns para conjuntos incluem a verificação eficiente da existência de objetos e a eliminação de itens duplicados. Conjuntos também suportam operações matemáticas como união, interseção, diferença e diferença simétrica.

Chaves ou a função set() podem ser usados para criar conjuntos.

c) Como obter a data_cancelamento (campo do dataframe B) vinculado aos registros do dataframe A?

In [46]:
df_a_mais_b = df_a.merge(
    right=df_b[['id_cliente', 'data_cancelamento']],
    how='inner',
    on='id_cliente'
)
display(df_a_mais_b)

,id,id_cliente,data_contratacao,id_contrato,valor_contrato,data_cancelamento
0,1,101,2023-01-15,201,1000.00,2023-05-15
1,2,102,2023-02-20,202,1500.50,2023-06-20
2,3,103,2023-03-10,203,800.25,2023-07-10
3,4,104,2023-04-05,204,1200.75,2023-08-05
4,5,105,2023-05-12,205,2000.50,2023-09-12

d) Encontre quantos clientes temos por data de contratacao no dataframe A.

In [47]:
qtd_clientes_contratacao = (
    df_a
    .groupby(['data_contratacao'])
    .agg({'id_cliente': 'count'})
    .rename(columns={'id_cliente': 'clientes'})
    .reset_index()
)
display(qtd_clientes_contratacao)

  data_contratacao  clientes
0       2023-01-15         1
1       2023-02-20         1
2       2023-03-10         1
3       2023-04-05         1
4       2023-05-12         1

e) Encontre quantos clientes temos por data de cancelamento no dataframe B.

In [48]:
qtd_clientes_cancelamento = (
    df_b
    .groupby(['data_cancelamento'])
    .agg({'id_cliente': 'count'})
    .rename(columns={'id_cliente': 'clientes'})
    .reset_index()
)
display(qtd_clientes_cancelamento)

  data_cancelamento  clientes
0        2023-05-15         1
1        2023-06-20         1
2        2023-07-10         1
3        2023-08-05         1
4        2023-09-12         1